{
    "spotlight": [
        {
            "title": "Kaiju No. 8 Season 2",
            "detail_page_url": "https://aniwatchtv.to/kaiju-no-8-season-2-19792",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/8a3c3a24bc6aebc4b3c01ca82a5033ed.jpg",
            "description": "After the destruction of their hometown, childhood friends Kafka Hibino and Mina Ashiro make a pact to become officers in the Defense Force—a militarized organization tasked with protecting Japan from colossal monsters known as \"kaijuu.\" Decades later, the 32-year-old Kafka has all but given up on his dreams of heroism. Instead, he cleans up the remains of the slaughtered kaijuu after they are defeated by valiant soldiers—including Mina, who has successfully achieved their shared goal.\r\n\r\nUpon meeting his new coworker, Reno Ichikawa, Kafka faces a mirror of his past self: an ambitious young man whose one desire is to fight as a member of the Defense Force. Unfortunately, the two are soon involved in a freak encounter with a rogue kaijuu. Though Kafka demonstrates his innate heroic nature and rescues Reno from certain doom, he is left gravely injured.\r\n\r\nWhile both men recover in a hospital, Kafka is seemingly attacked by another one of the beasts. As a result, he gains the ability to transform into a humanoid kaijuu with the strength and powers of the massive monsters menacing Japan. Dubbed \"Kaijuu No. 8\" by the military, Kafka resolves to use his newfound gifts for the greater good. Tied together by mutual respect, Kafka and Reno set out to join warriors like Mina at the forefront of the Defense Force.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "My Dress-Up Darling Season 2",
            "detail_page_url": "https://aniwatchtv.to/my-dress-up-darling-season-2-19794",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/41c10d21a2be8f2aef7491504eb64444.jpg",
            "description": "The second season of Sono Bisque Doll wa Koi wo Suru.\r\n\r\nWhen Marin Kitagawa and Wakana Gojo met, they grew close over their love for cosplay. Through interacting with classmates and making new cosplay friends, Marin and Wakana’s world keeps growing. New developments arise as Marin’s love for Wakana continues to be filled with endless excitement. In their ever-expanding world, Marin and Wakana’s story of cosplay and thrills continues!",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Dan Da Dan Season 2",
            "detail_page_url": "https://aniwatchtv.to/dan-da-dan-season-2-19793",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/4303d95c719242ab6e459d477b0a8c08.jpg",
            "description": "While the mission to exorcise Jin \"Jiji\" Enjouji's family home is underway, things are not going as expected. Momo Ayase narrowly evades an attempted abduction while Ken \"Okarun\" Takakura and Jiji are ambushed by the Kitou family—the unsettling landlords of the cursed estate. The trio's efforts threaten the foundation of this enigmatic town shrouded in legends and mysteries.\r\n\r\nAs Momo, Okarun, and Jiji are drawn deeper into the maze of folklore and supernatural entities, they must each utilize their unique powers if they want to survive and unravel the secrets of the uncanny town.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Dr. Stone: Science Future Part 2",
            "detail_page_url": "https://aniwatchtv.to/dr-stone-science-future-part-2-19784",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/7115a645c4676c6e11db7544b8d2e4ac.jpg",
            "description": "After a strategic maneuver, Senkuu Ishigami's team stalls Dr. Xeno's more scientifically advanced forces. A ceasefire between the two factions allows for the establishment of Corn City in North America, a hope for a future thriving population. Meanwhile, Senkuu and some of his teammates rush toward the Amazon in South America—the epicenter of the petrification beam's impact—to create Superalloy City and progress their spaceship project.\r\n\r\nWith dangerous enemies still pursuing Senkuu and his companions, it is a race against time to reach the heart of the dense Amazon. As unexpected allies and scientific creations further fuel this leg of their journey, Senkuu is closer than ever to finally uncovering the mystery behind the petrification phenomenon.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "I Was Reincarnated as the 7th Prince so I Can Take My Time Perfecting My Magical Ability Season 2",
            "detail_page_url": "https://aniwatchtv.to/i-was-reincarnated-as-the-7th-prince-so-i-can-take-my-time-perfecting-my-magical-ability-season-2-19781",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/cc90c348158e7ee0df92885576ad7603.jpg",
            "description": "The qualities valued most in the study of magic are bloodline, aptitude, and effort. There was one sorcerer who, despite his deep love for magic, was born a commoner and thus lacked the bloodline and aptitude for it. As he died an unnatural death, he wished he had studied magic more while he had the chance. Then, he was reincarnated as Lloyd, the seventh prince of the Kingdom of Saloum and one blessed with a strong magical bloodline. Reborn with all his memories intact, along with the perfect bloodline and immense talent, he was determined to enjoy his new life, using his extraordinary magical abilities to master the study of magic that was beyond his reach in his previous life!",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "The Rising of the Shield Hero Season 4",
            "detail_page_url": "https://aniwatchtv.to/the-rising-of-the-shield-hero-season-4-19790",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/f388247d0d1c9dfd45c9e704ebe031aa.jpg",
            "description": "The Four Cardinal Heroes are a group of ordinary men from modern-day Japan summoned to the kingdom of Melromarc to become its saviors. Melromarc is a country plagued by the Waves of Catastrophe that have repeatedly ravaged the land and brought disaster to its citizens for centuries. The four heroes are respectively bestowed a sword, spear, bow, and shield to vanquish these Waves. Naofumi Iwatani, an otaku, becomes cursed with the fate of being the \"Shield Hero.\" Armed with only a measly shield, Naofumi is belittled and ridiculed by his fellow heroes and the kingdom's people due to his weak offensive capabilities and lackluster personality.\r\n\r\nWhen the heroes are provided with resources and comrades to train with, Naofumi sets out with the only person willing to train alongside him, Malty Melromarc. He is soon betrayed by her, however, and becomes falsely accused of taking advantage of her. Naofumi then becomes heavily discriminated against and hated by the people of Melromarc for something he didn't do. With a raging storm of hurt and mistrust in his heart, Naofumi begins his journey of strengthening himself and his reputation. Further along however, the difficulty of being on his own sets in, so Naofumi buys a demi-human slave on the verge of death named Raphtalia to accompany him on his travels.\r\n\r\nAs the Waves approach the kingdom, Naofumi and Raphtalia must fight for the survival of the kingdom and protect the people of Melromarc from their ill-fated future.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Sakamoto Days Part 2",
            "detail_page_url": "https://aniwatchtv.to/sakamoto-days-part-2-19787",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/16938f0dfd1d36cab6a0c604ab4669d5.jpg",
            "description": "The legendary former hitman Tarou Sakamoto has thwarted numerous assassins after an enormous bounty on his head was issued. But he cannot seem to catch a break and simply take it easy with his beloved family. A mysterious and infamous figure known as Slur has brought a group of insane death row inmates to Japan, who hold back from nothing to eliminate their targets.\r\n\r\nSakamoto is not the only target—the criminals have been assigned to kill various other people, including the new hires at Sakamoto's convenience store, Shin Asakura and Lu Shaotang. The situation escalates even further when the Order, a group of the most skilled Japanese assassins, becomes involved. As the inmates begin wreaking havoc, Sakamoto and his allies must remain vigilant for the sake of everything they hold dear.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "One Piece",
            "detail_page_url": "https://aniwatchtv.to/one-piece-100",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/bcd84731a3eda4f4a306250769675065.jpg",
            "description": "Gold Roger was known as the \"Pirate King,\" the strongest and most infamous being to have sailed the Grand Line. The capture and execution of Roger by the World Government brought a change throughout the world. His last words before his death revealed the existence of the greatest treasure in the world, One Piece. It was this revelation that brought about the Grand Age of Pirates, men who dreamed of finding One Piece—which promises an unlimited amount of riches and fame—and quite possibly the pinnacle of glory and the title of the Pirate King.\r\n\r\nEnter Monkey Luffy, a 17-year-old boy who defies your standard definition of a pirate. Rather than the popular persona of a wicked, hardened, toothless pirate ransacking villages for fun, Luffy's reason for being a pirate is one of pure wonder: the thought of an exciting adventure that leads him to intriguing people and ultimately, the promised treasure. Following in the footsteps of his childhood hero, Luffy and his crew travel across the Grand Line, experiencing crazy adventures, unveiling dark mysteries and battling strong enemies, all in order to reach the most coveted of all fortunes—One Piece.\r\n\r\n[Written by MAL Rewrite]",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        }
    ],
    "trending": [
        {
            "title": "The Fragrant Flower Blooms with Dignity",
            "detail_page_url": "https://aniwatchtv.to/the-fragrant-flower-blooms-with-dignity-19789",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/f0b91bbbd75c16315c767bf3a9c8a3fc.jpg",
            "description": "Despite being adjacent to one another, Chidori Public High School and the all-girls Kikyo Private Academy seem to exist in two different worlds. While the latter boasts an immaculate reputation and favors students from wealthy backgrounds, the former is a nest for dim-witted delinquents. Everyone at Kikyo harbors a deep hatred for their Chidori neighbors.  Sixteen-year-old Rintarou Tsumugi is a student at Chidori whose intimidating face leads people to avoid him. Rintarou pays no mind to this, as he is content with his group of friends. However, there is something he has not told them yet: sometimes, he helps out at his family's cake shop.  One day at work, Rintarou sees a customer at a table, but she runs off before he can talk to her. The next day, he receives an apology from the girl, Kaoruko Waguri, who explains that she did not run away because of his appearance and that she believes Rintarou is a kind-hearted person. Although he is not used to Kaoruko's bright personality, Rintarou looks forward to forming a friendship with her. There is just one obstacle that stands in his way: Kaoruko is a Kikyo student!",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Gachiakuta",
            "detail_page_url": "https://aniwatchtv.to/gachiakuta-19785",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/acad8581f1a2eafa8c9d68b899bb1b21.jpg",
            "description": "Living in the slums of a wealthy town, Rudo and his foster father Regto try to coexist with the rest of the town's residents, but Rudo despises the wastefulness of the upper class. Ignoring the warnings from those around him, Rudo regularly rummages through the town's garbage in search of anything useful or valuable to save from the \"Abyss\"—a massive hole where anything considered trash is dumped, including people. Rudo's biological father was one such person, having been thrown into the Abyss after he was accused of murder.  One day, after running into a mysterious figure on the way home, Rudo returns to find Regto's dying body on the floor. He is immediately found at the scene by the authorities and is charged with murder. No one believes his claims of innocence, and he is thrown into the Abyss. Instead of dying, however, he finds himself in a strange, foul-smelling place surrounded by monsters made out of trash.  When Rudo is attacked by said monsters, he is saved by a man named Enjin, who reveals himself to be a \"Cleaner\"—someone who uses special weapons called Vital Instruments to combat these creatures. In order to get his revenge on the one who killed Regto, Rudo reluctantly becomes a Cleaner to fight his way back up and out of the Abyss.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "The Water Magician",
            "detail_page_url": "https://aniwatchtv.to/the-water-magician-19770",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/a3de30534cd752a56b7323d979cd08b9.jpg",
            "description": "Ryou is delighted to be reincarnated into the fantastical world of Phi, where he thinks he'll get to live a quiet life learning to use his newfound water magic. Going with the flow here, however, means something very different. Ryou is immediately pitted against the wild lands he winds up in and the slew of deadly monsters that call the remote subcontinent home. You'd think he'd forget about taking it easy when he's stuck fighting for his life, but lucky for Ryou, he's naturally optimistic, clever, and blessed with the hidden \"Eternal Youth\" trait. Twenty years pass in the blink of an eye, and each encounter along the way pushes him one step closer to the pinnacle of human magic. Little does he realize that's only the opening chapter of his tale. A fateful meeting soon thrusts Ryou to the forefront of history, forever changing the course of his life... Thus begins the adventures of the strongest water magician the world has ever seen—who also likes to do things at his own pace!",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "The Summer Hikaru Died",
            "detail_page_url": "https://aniwatchtv.to/the-summer-hikaru-died-19783",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/59ecd5571fb25e6b09ff27f580fd2fbb.jpg",
            "description": "Best friends Yoshiki and Hikaru have been stuck together like glue for most of their lives. Living in a small village and being the only children their age, the two boys find solace in each other's company. Their friendship seems picturesque at first glance, but Yoshiki has noticed a shift in Hikaru's demeanor ever since one fateful summer.  The \"Hikaru\" that sits beside him now is nothing like his friend. Despite his physical appearance and memories remaining exactly the same, Yoshiki knows something is amiss and that the Hikaru he once knew is gone. When he brings this up, Hikaru partially transforms into an otherworldly being, threatening to kill Yoshiki if he cannot accept it—while also professing its love for him.  Wracked with grief and unable to let go of his best friend, Yoshiki struggles to move on with his life as he finds himself getting closer to the new Hikaru. At the same time, strange occurrences begin to plague their village, bringing unsettling chaos.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Grand Blue Dreaming Season 2",
            "detail_page_url": "https://aniwatchtv.to/grand-blue-dreaming-season-2-19786",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/d2269ac1520195c3bd6bcca1246bc0b2.jpg",
            "description": "University is back in session for Iori, and so are the booze-fueled parties! Between diving club shenanigans, a surprise from his sister, and wild tests of courage, normal college life is anything but. Dive back into the madness with Iori and his beloved crew of lively splash artists.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        }
    ],
    "latest_episode": [
        {
            "title": "Puniru is a Kawaii Slime Season 2",
            "detail_page_url": "https://aniwatchtv.to/puniru-is-a-kawaii-slime-season-2-19734",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/a700000d4c4f6e959c69d353fc2a9c31.png",
            "description": "This is the story of Puniru the slime and Kotarou, a middle school student, until they cease being friends...\r\n\r\nKotarou Kawaii is a second-year middle school boy. When he was in elementary school, a slime he created came to life, and for the past seven years, he has been spending time with the slime named Puniru as his \"friend.\" However, there is one problem for Kotarou...\r\n\r\nOver the seven years, both have grown significantly, and Puniru has transformed into an incredibly beautiful girl!\r\n\r\nBesides her beautiful appearance, Puniru freely transforms into various cute forms as a slime, causing Kotarou to be both excited and bewildered by her carefree behavior every time.\r\n\r\nWill Puniru and Kotarou be able to continue spending time together as \"friends\" despite these challenging days ahead?",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Toilet-Bound Hanako-kun Season 2 Part 2",
            "detail_page_url": "https://aniwatchtv.to/toilet-bound-hanako-kun-season-2-part-2-19771",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/31e9bf1d374c8eb4d0011159dbc896c2.jpg",
            "description": "\"Hanako-san, Hanako-san... are you there?\"\r\n\r\nAt Kamome Academy, rumors abound about the school's Seven Mysteries, one of which is Hanako-san. Said to occupy the third stall of the third floor girls' bathroom in the old school building, Hanako-san grants any wish when summoned. Nene Yashiro, an occult-loving high school girl who dreams of romance, ventures into this haunted bathroom... but the Hanako-san she meets there is nothing like she imagined! Kamome Academy's Hanako-san... is a boy!",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Battle Through The Heavens 5th Season",
            "detail_page_url": "https://aniwatchtv.to/battle-through-the-heavens-5th-season-18119",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/069e39f99972004849bab4a2946d968c.jpg",
            "description": "In a land where no magic is present. A land where the strong make the rules and weak have to obey. A land filled with alluring treasures and beauty, yet also filled with unforeseen danger. Three years ago, Xiao Yan, who had shown talents none had seen in decades, suddenly lost everything. His powers, his reputation, and his promise to his mother. What sorcery has caused him to lose all of his powers? And why has his fiancee suddenly shown up?",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Witch Watch",
            "detail_page_url": "https://aniwatchtv.to/witch-watch-19552",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/80082b698ed84bf8d784d299faf50124.jpg",
            "description": "Nico Wakatsuki has finished her six years of witch training and is moving back to town by herself. As a new witch, she must choose a familiar to accompany her. However, unlike the other witches, she wishes to pick a non-animal familiar. There's no better companion than Morihito \"Moi\" Otogi—her childhood friend who happens to be an ogre. Morihito is vehemently opposed to being her servant, but he reluctantly accepts his fate after learning that a curse would revert him into a strange cow-tiger hybrid were he to disobey a witch's order.  Due to Morihito's father leaving for a business trip and Nico's mother remaining behind in the Witches' Holy Land, the two teens find themselves living together under the same roof. While Nico is ecstatic to be living with her crush, Morihito finds that her magical antics and overall clumsiness create more problems than solutions. With a prophesied disaster to befall Nico within the year, Morihito must do everything he can to protect her as her bodyguard while also upholding his duties as her familiar.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "A Record of Mortal's Journey to Immortality Season 3",
            "detail_page_url": "https://aniwatchtv.to/a-record-of-mortals-journey-to-immortality-season-3-19015",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/c113cfdf822840adf77c553d59794d85.jpg",
            "description": "Third season of .",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Nine: Ruler's Crown",
            "detail_page_url": "https://aniwatchtv.to/nine-rulers-crown-19741",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/bdeccca4a2f866aba719dcdb640cb8e7.jpg",
            "description": "The scene: Shiromitsugawa, a run-of-the-mill college town that has launched several failed attempts to drum up tourism and revitalize itself, including sponsoring a high-budget-but-poorly-written anime based on local folklore. A storm is about to descend on this sleepy town.  We follow Kakeru Niimi, a man who can be a bit curt at times but who has a strong sense of responsibility and a kind heart. Kakeru's ordinary life is thrown into chaos after the local shrine's sacred relic shatters. In the wake of this event, several young men and women awaken to superhuman abilities.  What was once a run-of-the-mill life in a run-of-the-mill town soon turns into a quest to track down a super-powered serial killer before they can strike again.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Punirunes: Puni 3",
            "detail_page_url": "https://aniwatchtv.to/punirunes-puni-3-19810",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/f2e1961fa1f8ca51c8a40908c049118f.jpg",
            "description": "The anime follows the daily life of PuniRunes—mysterious creatures who love to be coddled—and Yuka, a fourth-grade girl who loves soft, squishy things.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Nmeneko",
            "detail_page_url": "https://aniwatchtv.to/nmeneko-19697",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/6cc697363ca9cfa1498346961d0c9717.jpg",
            "description": "Follows the funny and amusing daily lives of two cats who want to live life doing only fun things.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "You and Idol Precure♪",
            "detail_page_url": "https://aniwatchtv.to/you-and-idol-precure-19509",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/890b72a89c29f9f02ffe82bdbf1f8298.jpg",
            "description": "Twenty-second Series.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "With You and the Rain",
            "detail_page_url": "https://aniwatchtv.to/with-you-and-the-rain-19762",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/cd4753d8a4d3ba94607dd9f60b23e3a6.jpg",
            "description": "During a rainy day, a woman comes across a strange animal waiting by the side of the road. Pleading to be taken in, the creature offers the woman an umbrella in an attempt to show off its appeal. Intrigued by its clever nature, she brings the dog-like creature home and thus begins their life together.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        }
    ],
    "new_": [
        {
            "title": "Tokyo Revengers: Tenjiku-hen [Uncensored]",
            "detail_page_url": "https://aniwatchtv.to/tokyo-revengers-tenjiku-hen-uncensored-18627",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/896483d9436d29a61443d35bdd00acff.jpg",
            "description": "After succeeding in their winter conflict against Taiju Shiba and his Black Dragons, the Tokyo Manji Gang absorbs their group's remaining members. Due to his heroic courage and indomitable spirit, Takemichi Hanagaki should have accomplished his goal of defeating the tragic fate awaiting his girlfriend, Hinata Tachibana.\r\n\r\nIn reality, Takemichi's troubles are far from over. Although Takemichi's actions have exposed Tetta Kisaki's treachery, the conniving schemer has found power elsewhere: Tenjiku, a dangerous gang led by the enigmatic Izana Kurokawa. Izana sets his sights on Manjirou \"Mikey\" Sano, pursuing a vicious interest in the Tokyo Manji Gang's aloof leader.\r\n\r\nIn the future, Takemichi discovers that the machinations of Izana and Kisaki led to Mikey's moral ruin—a downfall that directly results in Hinata's death. Unfortunately, a terrible loss robs Takemichi of his time-leaping ability, stranding him in the past with one final chance to rescue everyone he loves.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Tokyo Revengers: Tenjiku-hen",
            "detail_page_url": "https://aniwatchtv.to/tokyo-revengers-tenjiku-hen-18575",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/021ca452bd8b38c15f2e3c60e4a8c2ca.jpg",
            "description": "After succeeding in their winter conflict against Taiju Shiba and his Black Dragons, the Tokyo Manji Gang absorbs their group's remaining members. Due to his heroic courage and indomitable spirit, Takemichi Hanagaki should have accomplished his goal of defeating the tragic fate awaiting his girlfriend, Hinata Tachibana.\r\n\r\nIn reality, Takemichi's troubles are far from over. Although Takemichi's actions have exposed Tetta Kisaki's treachery, the conniving schemer has found power elsewhere: Tenjiku, a dangerous gang led by the enigmatic Izana Kurokawa. Izana sets his sights on Manjirou \"Mikey\" Sano, pursuing a vicious interest in the Tokyo Manji Gang's aloof leader.\r\n\r\nIn the future, Takemichi discovers that the machinations of Izana and Kisaki led to Mikey's moral ruin—a downfall that directly results in Hinata's death. Unfortunately, a terrible loss robs Takemichi of his time-leaping ability, stranding him in the past with one final chance to rescue everyone he loves.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Magical DoReMi",
            "detail_page_url": "https://aniwatchtv.to/magical-doremi-2687",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/fd64db22499f50dc5f5c8be5674e9b0f.jpg",
            "description": "Harukaze Doremi considers herself to be the unluckiest girl in the world. Her parents are always fighting, her little sister makes fun of her, and her crush pines after another girl. If only Doremi could just wave a magic wand, she would have a much better life—or so she used to think.\r\n\r\nAfter a mishap with a real witch, Doremi becomes an apprentice witch herself, and it turns out she's pretty horrible at that, too.\r\n\r\nNow she and her two friends must study to become better at magic so they can become good witches. That is, if they can focus on their magic studies!\r\n\r\nThe three apprentices will need all the luck they can get if they want to pass the witch exams and become full-fledged witches. Only then will Doremi's debt to the witch Majorika be repaid. Until then, Doremi will remain a useless little witch girl!",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Bâan: The Boundary of Adulthood",
            "detail_page_url": "https://aniwatchtv.to/baan-the-boundary-of-adulthood-19933",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/0998aaece9a99d786dd1493f730dc9b5.jpg",
            "description": "The story follows two individuals who leave their birthplaces behind in search of a new life, traveling through a mysterious warp gate that connects Japan to the world of Euthania. There, in a land rich in nature and home to magical races inspired by South East Asian mythology, they embark on a journey to find a place where they truly belong.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "The King of Wandering Cultivators",
            "detail_page_url": "https://aniwatchtv.to/the-king-of-wandering-cultivators-18438",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/37f95209d596b8205424e60f84de8db1.jpg",
            "description": "",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Betrothed to My Sister's Ex",
            "detail_page_url": "https://aniwatchtv.to/betrothed-to-my-sisters-ex-19766",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/f07c4f84740de00605287392e0e6f02f.jpg",
            "description": "The Shaderan family has fallen on hard times, and the avaricious and callous baron and baroness will stop at nothing to regain status. They favor their beautiful daughter Anastasia, hoping to marry her into wealth, while they treat the second daughter, Marie, no better than a servant. Years of abuse have convinced Marie that she is truly undeserving of love and attention.\r\n\r\nOn Marie's birthday—used as a ploy to showcase Anastasia—Marie meets Count Kyros Granado, who is immediately charmed by Marie and her knowledge of his culture. Believing Anastasia to be the one he fell for, Kyros proposes via letter. But Anastasia tragically dies on her way to marry him. Forced to take Anastasia's place, Marie becomes Kyros' fiancée, just as he originally intended. Although Marie terribly lacks confidence, Kyros gently helps her find her worth, awakening her to her own beauty and the true meaning of being loved.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Call of the Night Season 2",
            "detail_page_url": "https://aniwatchtv.to/call-of-the-night-season-2-19791",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/0e19ae2576c697406e319f26ac939fce.jpg",
            "description": "The second season of Yofukashi no Uta.\r\n\r\nKo overcomes his confusion about becoming a vampire and decides to \"like\" Nazuna, while Nazuna resolves to make Ko \"fall in love\" with her. Without understanding what \"love\" even is, the two of them spend their nights together in a frenzy. Meanwhile, Detective Uguisu Anko is closing in with her plot to kill vampires, not just Nazuna. A vampire's weakness is \"anything they were attached to when they were human\" and so they all try to get rid of this weakness before it's too late. But, Nazuna has no memory of her human life. What is Nazuna's hidden past? Why did Anko start killing vampires? And what is the \"secret\" that Nazuna and Anko share? For Ko, Nazuna, Anko, a fun \"late night\" doesn't end here... a new \"night\" begins!",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Welcome to the Outcast's Restaurant!",
            "detail_page_url": "https://aniwatchtv.to/welcome-to-the-outcasts-restaurant-19751",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/0fa01484297cdd8460e99d11efdf4667.jpg",
            "description": "Backstabbed by those he considered friends, Dennis has been exiled from one of the strongest guilds around: the Silver Wings Battalion. He doesn't think much of it, though, as he was dying to use his level 99 cooking skills anyway. That's why he decides to leave the city behind and open up a diner in the countryside.  While pursuing his dream, Dennis meets Atrielle, a girl exiled from her noble household and relegated to slavery until he saves her.  The pair open the diner together, and their first client is... an exiled knight from a different guild? How peculiar. But she is not the only customer; a cocky mage and a drastically overworked yet underpaid sage become regulars as well.  The knight brings trouble to the diner at times, but Dennis's cooking skills and beloved butcher knives cut through trouble and hunger alike!  Thus begins the legend of Dennis and his diner, the talk of the town!",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Ginga Tokkyuu Milky Subway",
            "detail_page_url": "https://aniwatchtv.to/ginga-tokkyuu-milky-subway-19733",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/8f41f5605e10e9c02f529d599b2ea80f.jpg",
            "description": "Arrested for reckless space driving, super human Chiharu and cyborg Makina are sentenced to clean the Milky☆Subway—an old interplanetary train.  Easy enough, right? Wrong. When the train suddenly takes off, they are thrown into a high-speed space-train spectacle packed with chaos, no plans, and zero strategy. Just pure momentum!",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Captivated, by You",
            "detail_page_url": "https://aniwatchtv.to/captivated-by-you-19738",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/58cf898b1e58faf8e9eac4fffb9d0962.jpg",
            "description": "Hayashi's frank, guileless demeanor quietly draws the attention of classmates and strangers as he counts all the stairs in school, photographs street signs, and dries sweet potatoes on the classroom balcony. In a world shaped by conformity, Hayashi is refreshingly and unapologetically true to himself. Conversely, Nikaidou has worked very hard to perfect a gloomy, dour façade that keeps his classmates far, far away. While much of the school regards Nikaidou as a bad omen, one student catches a glimpse behind the mask and-undeterred by rumors of bad luck and supernatural powers-begins to pick away Nikaidou's carefully crafted persona…",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        },
        {
            "title": "Lord of Mysteries",
            "detail_page_url": "https://aniwatchtv.to/lord-of-mysteries-19802",
            "image_url": "https://cdn.noitatnemucod.net/thumbnail/300x400/100/38c5a71674d8fc4af6ee57ffeb7b2617.jpg",
            "description": "In a Victorian world of steam, dreadnoughts, and occult horrors, Zhou Mingrui awakens as Klein Moretti. He walks a razor's edge between light and darkness, entangled with warring Churches. This is the legend of unlimited potential...and unspeakable danger.",
            "streaming_iframe_url": "",
            "servers": {
                "sub": [],
                "dub": []
            },
            "episodes": []
        }
    ],
    "top_upcoming": []
}